<h3> Cleaning the data

In [15]:
import pandas as pd

In [16]:
df=pd.read_csv('student_data.csv')

In [17]:
print(df.to_string)

<bound method DataFrame.to_string of     school sex  age address famsize Pstatus  Medu  Fedu      Mjob      Fjob  \
0       GP   F   18       U     GT3       A     4     4   at_home   teacher
1       GP   F   17       U     GT3       T     1     1   at_home     other
2       GP   F   15       U     LE3       T     1     1   at_home     other
3       GP   F   15       U     GT3       T     4     2    health  services
4       GP   F   16       U     GT3       T     3     3     other     other
..     ...  ..  ...     ...     ...     ...   ...   ...       ...       ...
390     MS   M   20       U     LE3       A     2     2  services  services
391     MS   M   17       U     LE3       T     3     1  services  services
392     MS   M   21       R     GT3       T     1     1     other     other
393     MS   M   18       R     LE3       T     3     2  services     other
394     MS   M   19       U     LE3       T     1     1     other   at_home

     ... famrel freetime  goout  Dalc  Walc health absences  G1  G2  G3
0    ...      4        3      4     1     1      3        6   5   6   6
1    ...      5        3      3     1     1      3        4   5   5   6
2    ...      4        3      2     2     3      3       10   7   8  10
3    ...      3        2      2     1     1      5        2  15  14  15
4    ...      4        3      2     1     2      5        4   6  10  10
..   ...    ...      ...    ...   ...   ...    ...      ...  ..  ..  ..
390  ...      5        5      4     4     5      4       11   9   9   9
391  ...      2        4      5     3     4      2        3  14  16  16
392  ...      5        5      3     3     3      3        3  10   8   7
393  ...      4        4      1     3     4      5        0  11  12  10
394  ...      3        2      3     3     3      5        5   8   9   9

[395 rows x 33 columns]>

In [ ]:
mydataset={
    'cars':["BMW","Tesla","Lamborgini"],
    'bus':["Micro","Nano","Sumo"]
}
mydataset

{'cars': ['BMW', 'Tesla'], 'bus': ['Micro', 'Nano']}

In [19]:
data=pd.DataFrame(mydataset)
data

    cars    bus
0    BMW  Micro
1  Tesla   Nano

In [ ]:
a=[1,7, 2]

In [21]:
data = {
  "Duration":{
    "0":60,
    "1":60,
    "2":60,
    "3":45,
    "4":45,
    "5":60
  },
  "Pulse":{
    "0":110,
    "1":117,
    "2":103,
    "3":109,
    "4":117,
    "5":102
  },
  "Maxpulse":{
    "0":130,
    "1":145,
    "2":135,
    "3":175,
    "4":148,
    "5":127
  },
  "Calories":{
    "0":409,
    "1":479,
    "2":340,
    "3":282,
    "4":406,
    "5":300
  }
}

In [22]:
df=pd.read_csv('cleaningdata.csv')

In [23]:
print(df.to_string)

<bound method DataFrame.to_string of    ID         Name     Age                  Email    JoinDate Salary
0   1     John Doe      25     john.doe@email.com  2023-01-15  50000
1   2   Jane Smith     NaN   jane.smith@email.com  2023-02-30  60000
2   3      Bob Lee  twenty          bob.lee@email  2022/12/01  55000
3   4  Alice Brown      30  alice.brown@email.com  2023-03-10    NaN
4   5     John Doe      25     john.doe@email.com  2023-01-15  50000
5   6          NaN      45         mark@email.com  2023-04-05  70000
6   7  Chris Evans      -5  chris.evans@email.com  2023-05-20  65000
7   8   Nina Patel      29   nina.patel@email.com  not_a_date  62000
8   9   Sam Wilson     120   sam.wilson@email.com  2023-06-01    abc
9  10   Jane Smith     NaN   jane.smith@email.com  2023-02-30  60000>

In [24]:
new_df=df.dropna()

In [25]:
print(new_df.to_string())

   ID         Name     Age                  Email    JoinDate Salary
0   1     John Doe      25     john.doe@email.com  2023-01-15  50000
2   3      Bob Lee  twenty          bob.lee@email  2022/12/01  55000
4   5     John Doe      25     john.doe@email.com  2023-01-15  50000
6   7  Chris Evans      -5  chris.evans@email.com  2023-05-20  65000
7   8   Nina Patel      29   nina.patel@email.com  not_a_date  62000
8   9   Sam Wilson     120   sam.wilson@email.com  2023-06-01    abc

In [ ]:
df = pd.read_csv('cleaningdata.csv')
new_df = df.dropna()
print(new_df.to_string())

   ID         Name     Age                  Email    JoinDate Salary
0   1     John Doe      25     john.doe@email.com  2023-01-15  50000
2   3      Bob Lee  twenty          bob.lee@email  2022/12/01  55000
4   5     John Doe      25     john.doe@email.com  2023-01-15  50000
6   7  Chris Evans      -5  chris.evans@email.com  2023-05-20  65000
7   8   Nina Patel      29   nina.patel@email.com  not_a_date  62000
8   9   Sam Wilson     120   sam.wilson@email.com  2023-06-01    abc